//  -*-  coding: utf-8; mode: c++  -*-  //
/*************************************************************************
**                                                                      **
**                      --  My Operating System --                      **
**                                                                      **
**          Copyright (C), 2015-2015, Takahiro Itou                     **
**          All Rights Reserved.                                        **
**                                                                      **
*************************************************************************/

/**
**      メモリマップ。
**
**      @file   include/MemoryMap.h
**/

#if !defined( MYOS1_KERNEL_INCLUDED_MEMORY_MAP_H )
#    define   MYOS1_KERNEL_INCLUDED_MEMORY_MAP_H

//========================================================================
//
//      ブートローダ関連。
//

/**
**    ブートセクタのコピーを保存するアドレス。
**
**  ベース：0x00000800 - 0x000009FF
**  サイズ：0x00000200 (512)
**/
#define     MM_ADDR_COPY_BOOT_SECTOR        0x0800

/**
**    起動情報を格納するアドレス。
**
**  ベース：0x00000A00 - 0x00000FFF
**  サイズ：0x00000600 (1,536)
**/
#define     MM_ADDR_STORE_BOOT_INFO         0x0A00

//========================================================================
//
//      ファイルシステム関連。
//

/**
**    ファイルアロケーションテーブルをロードするアドレス。
**
**  ベース：0x00001000 - 0x000021FF
**  ベース：0x00002200 - 0x000033FF （予備）
**  サイズ：0x00002400 (9,216)
**/
#define     MM_ADDR_LOAD_FAT                0x1000

/**
**    ルートディレクトリ領域をロードするアドレス。
**
**  ベース：0x00003400 - 0x00004FFF
**  サイズ：0x00001C00 (7,168)
**/
#define     MM_ADDR_LOAD_ROOT_DIR           0x3400

//========================================================================
//
//      カーネルイメージ関連。
//

/**
**    フォントファイルをロードするアドレス。
**/
#define     FONT_ASCII_ADDR         0x00002000

/**
**    カーネルを壱時的にロードしておくアドレス。
**/
#define     KERNEL0_TEMP_ADDR       0x00004000

/**
**    カーネルをロードするアドレス。
**/
#define     KERNEL0_BASE_ADDR       0x00100000

/**
**    割り込み記述子を配置するアドレス。
**
**  ベース：0x00268000 - 0x002687FF
**  サイズ：0x00000800 (2048)
**/
#define     INTGATE_DESCRIPTOR_ADDR     0x00268000

#endif
